index.tex
% Created 2025-01-16 Thu 15:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.19)}, 
 pdflang={English}}
\begin{document}

\begin{center}
SUNY POLYTECHNIC INSTITUTE

SCHOOL OF BUSINESS ADMINISTRATION
\end{center}
\begin{center}
\textbf{\textbf{FIN 420: FINANCIAL ANALYTICS}}
\end{center}

\textbf{\textbf{Instructor}}: Matthew Brigida, Ph.D.

\textbf{\textbf{Office}}: Donovan 1277 \\
\textbf{\textbf{Office Hours}}: Online in Brightspace \\
\textbf{\textbf{Email}}:  matthew.brigida@sunypoly.edu \\
\textbf{\textbf{Class Location}}: Brightspace \\
\textbf{\textbf{Class Day/Time}}: Online (Asynchronous) \\


\textbf{\textbf{Supplementary Texts/Materials}}:
\begin{itemize}
\item \href{https://financial-education.github.io/}{Financial Education}
\end{itemize}
\section{Description}
\label{sec:org276cc66}

An overview of analytical methods used in finance, and their applications.  Particular focus will be paid to methods for handling large data sets used in high-frequency trading, and machine learning and artificial intelligence methods applied to banking, investments, and energy markets.
\subsection{Course Learning Outcomes \& Objectives}
\label{sec:org5004388}

\begin{itemize}
\item CLO 1. Technical Competence: Adept in applying analytics technology to solve institutional problems and enable effective financial decision making.
\item CLO 2. Analytical Problem Framing: Demonstrate individual capacity to evaluate and deploy analytical methods selected from a diverse portfolio of tools analyze and manage common financial decisions.
\item CLO 3. Strategic and Integrative Thinking: Understand the baseline resources available for analyzing and managing a firm’s financial performance. Including collecting data, processing information and evaluating and communicating outcomes with partners; differentiate between the accounting function as a preparer of data and information and the finance function as a user of information for decision making and the role of ethics in the process.
\item CLO 4. Leadership and Communication: Be capable of expressing key concepts and terms commonly used in financial analytics; by using effective written, oral and interpersonal communications to contribute to the financial performance of financial firms.
\end{itemize}
\section{Due Dates}
\label{sec:orgacaee6b}

The week 1 Colab notebook is due February 1.  Each Sunday thereafter the next Colab notebook is due.  For example, the week 2 Colab notebook is due February 8th.

It is important that you submit your assignment by the due date, particularly early in the semester.  By doing so we can identify any issues early.  If you submit your notebook after the due date you will receive a 0 on the assignment.
\section{How to Submit Your Colab Notebook}
\label{sec:org9ab71a1}

To submit your notebook simply paste the link to your completed notebook in the D2L/Brightspace dropbox.  There are two additional key points:

\begin{enumerate}
\item Make sure your Colab notebook sharing setting is set to 'viewable by anyone on the web'.  I can't grade your notebook if I can't see it.
\item If you open a notebook and modify it, it doesn't automatically create a new URL.  So if you copy the URL and submit it, you are giving me a link to \emph{my own notebook} with none of your changes. So once you modify a notebook that you want to submit, save the Colab notebook to Google Drive to create a unique URL.
\end{enumerate}
\section{Course Outline}
\label{sec:org2c103a2}

\href{https://financial-education.github.io/python\_for\_finance\_outline/}{See the weekly Colab Notebook links and videos in the course outline.}
\section{Exams}
\label{sec:org8c30616}

There are no exams scheduled, however a final exam may be added at the instructor's discretion. 
\section{Attendance/Participation}
\label{sec:orga0ddc9c}

Throughout the semester I will take attendance, may give unannounced quizzes, and otherwise evaluate your participation.  Failure to attend class and participate will reduce your participation score.
\section{Grading}
\label{sec:org64c6558}

\begin{center}


\begin{center}
\begin{tabular}{lr}
Item & Points\\
\hline
Assignments & 90\\
Attendance/Participation & 10\\
\hline
Total Points & 100\\
\hline
\end{tabular}
\end{center}
\end{center}

\begin{itemize}
\item 90 - 100 A
\item 80 - 89.9 B
\item 70 - 79.9 C
\item 60 - 69.9 D
\item \(<\) 60 F
\end{itemize}

\begin{quote}
+/- grades may be assigned at the instructors discretion.
\end{quote}
\subsection{An Important Note on Grading}
\label{sec:orgf00abf6}

\begin{quote}
There is no special consideration if you need a certain grade in this course to graduate.  \textbf{\textbf{If you require a certain grade in this class to graduate it is your responsibility to earn that grade.}} Specifically if you receive a `D` in this course I will not allow you to do extra assignments after the course is complete in exchange for a higher grade. 
\end{quote}
\section{How To Ask Questions}
\label{sec:org3f0bc81}

The more information you provide, the more likely I will be able to answer your question.  If you simply say "I got an error" then you should not expect anyone to be able to help.  At the very least provide the text of the error.

\href{https://stackoverflow.com/help/how-to-ask}{See this post.}  
\section{Email Communication}
\label{sec:orgfc50659}

Questions about course material should be asked in class.  Email should only be used for personal matters.  When sending an email, be sure to put the course in the subject line (FIN 420). 
\section{Guidelines and Accommodations}
\label{sec:orga0de6fb}

Academic Integrity Policy Students Enrolled in this course are required to understand and fully comply with all aspects of the Academic Integrity Policy as described in the SUNY Polytechnic Institute Handbook (available at:  \url{https://sunypoly.edu/pdf/student\_handbook.pdf} )
\subsection{Accommodations for Students with Disabilities}
\label{sec:orgc3a4128}

\begin{quote}
In compliance with the Americans with Disabilities Act of 1990 and Section 504 of the Rehabilitation Act, SUNY Polytechnic Institute is committed to ensuring comprehensive educational access and accommodations for all registered students seeking access to meet course requirements and fully participate in programs and activities.  Students with documented disabilities or medical conditions are encouraged to request these services by registering with the Office of Disability Services. Please request accommodations early in the semester, or as soon as you become registered with Disability Services, so that we have adequate time to arrange your approved academic accommodation/s.  Once Disability Services creates your accommodation plan, it is your responsibility to provide me a copy of the accommodation plan.

If you experience any access concerns that may require the need for adaptive or alternate format/presentation of materials, reach out to me or Disability Services right away. 

For information related to these services or to schedule an appointment, please contact the Office of Disability Services using the information provided below.  The Office of Disability Services can accommodate virtual meeting requests.  The website has helpful information, and the link can be found here: \url{https://sunypoly.edu/student-life/diversity-equity-inclusion/disabilities-services/contact-us.html}
\end{quote}
\section{Bonus Project Ideas}
\label{sec:org7f797c0}

None of these are necessary, and should not take the place of any assigned work.

\begin{itemize}
\item Cryptocurrency Factor Model
\item \href{https://colab.research.google.com/drive/1OtpEsx3RyoishcmKX4Q0a\_DZ2XHM3rje?usp=sharing}{Option Greeks in Margrabe}
\item The Pairs Trade
\item Classify Failed Banks with a Deep Neural Network
\item Algorithm Identification in High-Frequency Markets
\item Determining the Effect of Bank Capital Adequacy Requirements
\item Bank Stress Testing
\item Machine Learning in Portfolio Construction
\item Constructing an Artificial Intelligence Investment Advisor
\end{itemize}
\end{document}
